joemowed/clock/samd51/DFP/src/startup_samd51j20a.cpp
/*
 * GCC startup file for ATSAMD51J20A
 *
 * Copyright (c) 2024 Microchip Technology Inc.  and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

#include "samd51j20a.h"
extern "C" {
/* Initialize segments */
extern uint32_t _sfixed;
extern uint32_t _efixed;
extern uint32_t _etext;
extern uint32_t _srelocate;
extern uint32_t _erelocate;
extern uint32_t _szero;
extern uint32_t _ezero;
extern uint32_t _sstack;
extern uint32_t _estack;

/* Optional application-provided functions */
extern void __attribute__((weak, long_call)) _on_reset(void);
extern void __attribute__((weak, long_call)) _on_bootstrap(void);
extern void __attribute__((weak, long_call)) _on_exit(void);

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
int main(void);
/** \endcond */

void __libc_init_array(void);

/* Reset handler */
void Reset_Handler(void);

/* Default empty handler */
void Dummy_Handler(void);

/* Cortex-M4 core handlers */
void NonMaskableInt_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void HardFault_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void MemoryManagement_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void BusFault_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void UsageFault_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SVCall_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DebugMonitor_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PendSV_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SysTick_Handler(void) __attribute__((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void PM_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void MCLK_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void OSCCTRL_XOSC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void OSCCTRL_XOSC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void OSCCTRL_DFLL_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void OSCCTRL_DPLL0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void OSCCTRL_DPLL1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void OSC32KCTRL_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SUPC_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SUPC_BODDET_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void WDT_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void RTC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_4_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_5_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_6_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_7_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_8_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_9_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_10_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_11_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_12_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_13_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_14_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_EXTINT_15_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void FREQM_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void NVMCTRL_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void NVMCTRL_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EVSYS_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EVSYS_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EVSYS_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EVSYS_3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EVSYS_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PAC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void RAMECC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM0_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM0_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM0_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM0_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM1_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM1_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM1_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM1_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM2_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM2_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM2_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM2_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM3_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM3_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM3_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM3_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM4_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM4_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM4_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM4_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM5_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM5_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM5_2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM5_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void USB_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void USB_SOF_HSOF_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void USB_TRCPT0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void USB_TRCPT1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_MC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_MC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_MC2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_MC3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_MC4_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC0_MC5_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC1_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC1_MC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC1_MC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC1_MC2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC1_MC3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC2_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC2_MC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC2_MC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC2_MC2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC3_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC3_MC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC3_MC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC4_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC4_MC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TCC4_MC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC3_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC4_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC5_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PDEC_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PDEC_MC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PDEC_MC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ADC0_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ADC0_RESRDY_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ADC1_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ADC1_RESRDY_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void AC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DAC_OTHER_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DAC_EMPTY_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DAC_EMPTY_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DAC_RESRDY_0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DAC_RESRDY_1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void I2S_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PCC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void AES_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TRNG_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ICM_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PUKCC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void QSPI_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SDHC0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__((section(".vectors"))) const DeviceVectors exception_table = {

    /* Configure Initial Stack Pointer, using linker-generated symbols */
    .pvStack = (void *)(&_estack),

    .pfnReset_Handler = (void *)Reset_Handler,
    .pfnNonMaskableInt_Handler = (void *)NonMaskableInt_Handler,
    .pfnHardFault_Handler = (void *)HardFault_Handler,
    .pfnMemoryManagement_Handler = (void *)MemoryManagement_Handler,
    .pfnBusFault_Handler = (void *)BusFault_Handler,
    .pfnUsageFault_Handler = (void *)UsageFault_Handler,
    .pvReservedC9 = (void *)(0UL), /* Reserved */
    .pvReservedC8 = (void *)(0UL), /* Reserved */
    .pvReservedC7 = (void *)(0UL), /* Reserved */
    .pvReservedC6 = (void *)(0UL), /* Reserved */
    .pfnSVCall_Handler = (void *)SVCall_Handler,
    .pfnDebugMonitor_Handler = (void *)DebugMonitor_Handler,
    .pvReservedC3 = (void *)(0UL), /* Reserved */
    .pfnPendSV_Handler = (void *)PendSV_Handler,
    .pfnSysTick_Handler = (void *)SysTick_Handler,

